<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [2]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup

In [3]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [4]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# текст запроса
query_3_1 = f'''select *
from public.vacancies 
'''

In [6]:
# результат запроса
df = pd.read_sql_query(query_3_1,connection);
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\3326877871.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1,connection);

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
# текст запроса
query_3_2 = f'''select distinct e.id
from public.EMPLOYERS e
'''

In [8]:
# результат запроса
df = pd.read_sql_query(query_3_2,connection);
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\3587340783.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2,connection);

            id
0      4898037
1      5969955
2      2056231
3      4808196
4      1166354
...        ...
23496  2748834
23497  2351276
23498   880080
23499    67563
23500  3386207

[23501 rows x 1 columns]

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
# текст запроса
query_3_3 = f'''select distinct a.id
from public.AREAS a
'''

In [10]:
# результат запроса
df = pd.read_sql_query(query_3_3,connection);
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2483873282.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3,connection);

        id
0     1798
1     1269
2     4790
3     1989
4     1560
...    ...
1357  1421
1358  4035
1359    55
1360  3734
1361  5134

[1362 rows x 1 columns]

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
# текст запроса
query_3_4 = f'''select distinct i.id
from public.INDUSTRIES i
'''

In [12]:
# результат запроса
df = pd.read_sql_query(query_3_4,connection);
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1795695867.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4,connection);

         id
0    27.564
1    42.609
2    24.635
3    49.414
4    27.561
..      ...
289  39.444
290   8.486
291  41.519
292  45.534
293  27.565

[294 rows x 1 columns]

***

In [13]:
# выводы по предварительному анализу данных
# В таблице vacancies      всего 49 197 вакансий 
# в таблицу EMPLOYERS      всего 23 501 организаций - чуть больше 2х вакасий на одну организаци.
# в таблице AREAS          всего 1 362 регионов
# в таблице INDUSTRIES     всего   294 сфкры деятельности
#

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [14]:
# Выполнение SQL-запросов
vacancies_with_areas_query = '''select * from public.vacancies v join public.areas a on v.area_id = a.id'''
# я сейчас перечитываю решение перед отправкой и понимаю что можно было некоторые вещи сделать и в самом запросе в базу. мне почемму - то кажется обработать на пайтоне вернеею но если это не так дайте знатью.

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2581563372.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_areas = pd.read_sql_query(query_areas, connection)

In [15]:
# результат запроса
df_vacancies_with_areas = pd.read_sql_query(vacancies_with_areas_query, connection)
last_column = df_vacancies_with_areas.columns[-1]
# Переименовываем последний столбец
df_vacancies_with_areas.columns.values[-1] = 'area_name'
group_by_area = df_vacancies_with_areas.groupby('area_name')['name'].count().reset_index()
group_by_area = group_by_area.rename(columns={'name':'cnt'})
group_by_area = group_by_area.sort_values(by='cnt', ascending=False)
display(group_by_area)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\104386611.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_vacancies = pd.read_sql_query(query_vac, connection)
C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\104386611.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_vacancies_with_areas = pd.read_sql_query(vacancies_with_areas_query, connection)

           area_name   cnt
409           Москва  5333
564  Санкт-Петербург  2851
395            Минск  2112
457      Новосибирск  2006
21            Алматы  1892
..               ...   ...
420            Надым     1
419            Навои     1
418         Навашино     1
413          Мурмаши     1
768               Яя     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [16]:
# текст запроса
# так это можно сделать без запроса в баззу - в данном конкретном случае вся исходная инфа уже есть но дальше решение с запросом
df_vacancies_with_areas['is_at_least_one_salary_filed_filled'] = df_vacancies_with_areas['salary_from'].notna() | df_vacancies_with_areas['salary_to'].notna()
filled_cout = df_vacancies_with_areas['is_at_least_one_salary_filed_filled'].sum()
print('Заполнено хотя бы одно поле у следуюшего числа вакансий :' , filled_cout)
display(filled_cout)

# теперь запрос
salary_query = '''select * 
from public.vacancies v 
where v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL'''

Заполнено хотя бы одно поле у следуюшего числа вакансий : 24073

24073

In [17]:
# результат запроса
df = pd.read_sql_query(salary_query, connection)
filled_records_count = df.shape[0]
display(filled_records_count)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\491185644.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(salary_query, connection)

24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [18]:
# текст запроса
avg_salary_from_and_to = '''select ROUND(AVG(v.salary_from)) as avg_salary_from, ROUND(AVG(v.salary_to)) as  avg_salary_to
from public.vacancies v
where v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL
'''

In [19]:
# результат запроса
df = pd.read_sql_query(avg_salary_from_and_to, connection)
display(df)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2508433479.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(avg_salary_from_and_to, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [20]:
# текст запроса
query= '''SELECT v.schedule, v.employment, COUNT(v.id) as count
from public.vacancies v
group by v.schedule, v.employment
order by 3 desc
OFFSET 1
LIMIT 1
'''

In [21]:
# результат запроса
df = pd.read_sql_query(query, connection)
display(df)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2018853382.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           schedule        employment  count
0  Удаленная работа  Полная занятость   7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [22]:
# текст запроса
query= '''SELECT v.experience, count(v.id) as count
from public.vacancies v
group by v.experience
order by 2

'''

In [23]:
# результат запроса
df = pd.read_sql_query(query, connection)
display(df)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2018853382.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [24]:
# выводы по детальному анализу вакансий
# из первого запроса мы четко видим что основная масса вакансий приходится на крупнейшие города такие как Москва, Питер,Минск, Новосибирск, Алматы

# далее мы понимаем что из почти 50 000 вакансий только у 24 000 запонено ХОТЬ ОДНО из полей по ожиданиям по зарплате, что для меня стало сюрпризом. не очень пока понятно как анализировать реъюме если в них нет указаний по зп - разберемся с этим позднее.

# В среднем те кто заполняют данные по ЗП ожидают получать в среднем от 71 065.0 и до 110 537.0

# большую часть соискателей итересует полный рабочий день и постоянная занятость, далее по популярности илет удаленная работа с полной занятостью.

# больше всего на рынке людей с опытом работы от 1 года до 3. меньше всего специалистов с опытом более 6 лет - я полагаю с приличным опытом уже не все ищут работу черз HH.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [25]:
# текст запроса
query_empl = '''SELECT e.id as employer_id, e.name as empolyer_name, COUNT(v.id) as count_vacancies
from public.vacancies v
left join public.employers e on v.employer_id = e.id
group by e.id
ORDER BY 3 desc
LIMIT 5
'''

In [26]:
# результат запроса
df = pd.read_sql_query(query_empl, connection)
result = df.iloc[[0, 4]]  
print(result)
# display(df)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\393289226.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_empl, connection)

   employer_id  empolyer_name  count_vacancies
0         1740         Яндекс             1933
4        39305  Газпром нефть              331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [27]:
# текст запроса
query = '''SELECT 
    a.id AS area_id, 
    a.name AS area_name, 
    COUNT(DISTINCT v.employer_id) AS count_employers, 
    COUNT(v.id) AS count_vacancies
FROM 
    public.areas a
LEFT JOIN 
    public.vacancies v ON a.id = v.area_id
GROUP BY 
    a.id, a.name
HAVING 
    COUNT(v.id) = 0 AND COUNT(v.employer_id) > 0
ORDER BY 
    count_employers DESC 
'''

In [28]:
# результат запроса
df = pd.read_sql_query(query, connection)
df
# я не знаю почему нет ни одного региона без вакансий но с работодателоями

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\3522406262.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

Empty DataFrame
Columns: [area_id, area_name, count_employers, count_vacancies]
Index: []

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [29]:
# текст запроса
query = '''SELECT COUNT(distinct v.area_id) areas_count,  e.name employer_name
FROM public.vacancies v
left join public.employers e on v.employer_id = e.id
group by  e.name
order by 1 desc
'''

In [30]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

       areas_count           employer_name
0              181                  Яндекс
1              152              Ростелеком
2              116              Спецремонт
3               88  Поляков Денис Иванович
4               71               ООО ЕФИН
...            ...                     ...
14761            1                  UniSol
14762            1            UNISTORY LLC
14763            1                   UNIT6
14764            1     United Distribution
14765            1              UNITEL LLC

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [31]:
# текст запроса
query = '''SELECT *
FROM public.employers_industries ei
WHERE ei.industry_id IS NULL
'''

In [32]:
# результат запроса
df = pd.read_sql_query(query, connection)
df
# нету в таблице employers_industriesработодателей у которых не указана сфера деятельности - хотя я ви жу что это не правильно. я делал на всякий случай дистинк всем сферам что бы изучить - вдруг там что то написано что символизирует остуствие информации но нетю мне не удалост выявить проблему

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\3123204941.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

Empty DataFrame
Columns: [employer_id, industry_id]
Index: []

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [33]:
# текст запроса
query = '''SELECT e.name emp_name, count(ei.industry_id) ind_count
FROM public.employers_industries ei
left join public.employers e on ei.employer_id = e.id
group by e.name
HAVING  count(ei.industry_id) = 4 
ORDER BY 1
OFFSET 2
LIMIT 1

'''

In [34]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

  emp_name  ind_count
0     2ГИС          4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [35]:
# текст запроса
query = '''SELECT COUNT(distinct ei.employer_id)
FROM public.EMPLOYERS_INDUSTRIES ei
LEFT JOIN public.INDUSTRIES i on ei.industry_id = i.id
WHERE i.name = 'Разработка программного обеспечения'




'''

In [36]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [37]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
table = page.find('table', attrs={'class': 'standard sortable'})

if table:
    rows = table.find_all('tr')[1:]  # Пропускаем первую строку с заголовками таблицы
else:
    rows = []
cities = []
for row in rows:
    cols = row.find_all('td')
    if cols:  # Проверяем, что строка не пустая
        city = cols[1].text.strip()  # Название города находится во втором столбце
        cities.append(city)
for city in cities:
    print(city)
    
    
cities_str = ', '.join([f"'{city}'" for city in cities])

Москва
Санкт-Петербург
Новосибирск
Екатеринбург
Казань
Красноярск
Нижний Новгород
Челябинск
Уфа
Самара
Ростов-на-Дону
Краснодар
Омск
Воронеж
Пермь
Волгоград

In [38]:
# текст запроса
# query1 = f'''SELECT
# a.name as region_name, COUNT(*) as cnt 
# FROM public.vacancies v
# LEFT JOIN public.areas a ON v.area_id = a.id
# LEFT JOIN public.employers e ON e.id = v.employer_id
# WHERE a.name IN ({cities_str}) AND e.name = 'Яндекс'
# GROUP BY a.name
# ORDER BY 2


# UNION ALL

# SELECT 
#     'Total' as region_name, COUNT(*) as cnt
# FROM public.vacancies v
# LEFT JOIN public.areas a ON v.area_id = a.id
# LEFT JOIN public.employers e ON e.id = v.employer_id
# WHERE a.name IN ({cities_str}) AND e.name = 'Яндекс'

# '''
query = f'''
SELECT
    a.name as region_name, COUNT(*) as cnt 
FROM public.vacancies v
LEFT JOIN public.areas a ON v.area_id = a.id
LEFT JOIN public.employers e ON e.id = v.employer_id
WHERE a.name IN ({cities_str}) AND e.name = 'Яндекс'
GROUP BY a.name

UNION ALL

SELECT 
    'Total' as region_name, COUNT(*) as cnt
FROM public.vacancies v
LEFT JOIN public.areas a ON v.area_id = a.id
LEFT JOIN public.employers e ON e.id = v.employer_id
WHERE a.name IN ({cities_str}) AND e.name = 'Яндекс'
ORDER BY 2

'''

In [39]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

        region_name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

***

In [40]:
# выводы по анализу работодателей
# После краткого анализа работодателей мы выяснили седующие факты:
# 1) пятерка крупнейших работодателей РФ : 

# -	Яндекс	1933 вакансий
# -	Ростелеком	491 вакансий
# -	78638	Тинькофф	444 вакансий
# -	СБЕР	428 вакансий
# -	Газпром нефть	331 вакансий




# 2)  Мы выявили топ работодателй покрывающий наибольшее колитчество решионов
	
	# 181 региона у	Яндекс
	# 152 региона у	Ростелеком
	# 116 региона у	Спецремонт
	# 88 региона у	Поляков Денис Иванович
	# 71 региона у	ООО ЕФИН

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [63]:
# текст запроса
query = f'''
SELECT *
from public.vacancies v
'''

In [68]:
# результат запроса
df = pd.read_sql_query(query, connection)
# df
search_strings = ['данн', 'data']

#  регулярное выражение для поиска любого из слов
regex_pattern = '|'.join(search_strings)

# Выберем строки, где в столбце name содержатся указанные слова без учета регистра, игнорируя NaN
filtered_df = df[df['name'].str.contains(regex_pattern, case=False, na=False)]

print(filtered_df)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2885710406.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

             id                                               name  \
105    66075509  Аналитик хранилищ данных и BI-систем/Аналитик ...
134    55462336                           Data-analysts (удаленно)
142    55348138  Стажер Data Engineer/Data Аналитик в команду Б...
151    54629664                 Старший специалист хранилищ данных
192    55348337                   Администратор баз данных и сетей
...         ...                                                ...
49036  66079596        Программист Delphi / разработчик баз данных
49089  55219239                  Разработчик баз данных (Big Data)
49100  55900304                                    Аналитик данных
49127  66185897              Data аналитик /Аналитик BI (удаленно)
49196  55547842                                   DataOps Engineer

                                              key_skills          schedule  \
105    SQL\tREST API\tBI-систем/ EAM(ТОиР)\tПроектная...       Полный день
134             SQL\tPython\tPostgreSQL\tDocker\tTableau  Удаленная работа
142                           Python\tSQL\tMS PowerPoint       Полный день
151    SQL\tORACLE\tБазы данных\tETL\tБаза данных: Or...       Полный день
192                                                 None       Полный день
...                                                  ...               ...
49036                                               None       Полный день
49089  SQL\tАнглийский язык\tORACLE\tMS SQL\tБазы дан...  Удаленная работа
49100  Работа с большим объемом информации\tАнализ да...       Полный день
49127   Python\tTableau\tSQL\tLinux\tОбучение и развитие  Удаленная работа
49196                                               None  Удаленная работа

               experience        employment  salary_from  salary_to  area_id  \
105    От 1 года до 3 лет  Полная занятость          NaN        NaN       43
134    От 1 года до 3 лет  Полная занятость          NaN        NaN       98
142             Нет опыта        Стажировка          NaN        NaN        1
151    От 1 года до 3 лет  Полная занятость          NaN        NaN       88
192    От 1 года до 3 лет  Полная занятость          NaN        NaN      246
...                   ...               ...          ...        ...      ...
49036  От 1 года до 3 лет  Полная занятость      80000.0        NaN       26
49089  От 1 года до 3 лет  Полная занятость          NaN        NaN       75
49100  От 1 года до 3 лет  Полная занятость      70000.0    70000.0        2
49127  От 1 года до 3 лет  Полная занятость          NaN        NaN       26
49196       От 3 до 6 лет  Полная занятость          NaN        NaN      160

       employer_id
105        8645304
134         150082
142           3529
151           7944
192         194646
...            ...
49036        81154
49089         3776
49100      2953546
49127        84585
49196      4978627

[1771 rows x 10 columns]

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [107]:
# текст запроса

query = '''SELECT *
FROM public.vacancies v
WHERE LOWER(v.name) LIKE '%data scientist%'
   OR LOWER(v.name) LIKE '%data science%'
   OR LOWER(v.name) LIKE '%исследователь данных%'
   OR LOWER(v.name) LIKE '%machine learning%'
   OR LOWER(v.name) LIKE '%машинн%обучен%'
   OR (LOWER(v.name) LIKE '% ml%' OR LOWER(v.name) LIKE 'ml %' OR LOWER(v.name) LIKE '% ml.' OR LOWER(v.name) LIKE 'ml.%')'''
# query2 = '''SELECT COUNT(*)
# FROM public.vacancies
# WHERE (
#     LOWER(name) LIKE '%data scientist%'
#     OR LOWER(name) LIKE '%data science%'
#     OR LOWER(name) LIKE '%исследователь данных%'
#     OR LOWER(name) LIKE '%machine learning%'
#     OR LOWER(name) LIKE '%машинн%обучен%'
#     OR (LOWER(name) LIKE '% ml%' OR LOWER(name) LIKE 'ml %' OR LOWER(name) LIKE '% ml.' OR LOWER(name) LIKE 'ml.%')
# )
# AND (
#     LOWER(name) LIKE '%junior%'
#     OR experience = 'Нет опыта'
#     OR employment = 'Стажировка'
# );'''

In [109]:
# результат запроса  - 439
df = pd.read_sql_query(query, connection)
df





junior_vacancies = df[
    (df['name'].str.contains('junior', case=False, na=False)) |
    (df['experience'] == 'Нет опыта') |
    (df['employment'] == 'Стажировка')
]
# # # Платформа определяет данный  48 вакансий для джунов ответ как неверный. Дейсвтиетльн ручная проверка выявила некоторые несоответсвия 
# # # например 36418	54948266	Senior Data Scientist (AI)	Computer Vision\tPyTorch\tTensorflow\tDeep Lea...	Полный день	Нет опыта	Полная занятость
# # # но это в рамках условий задания. 
# # print(f"Количество вакансий для начинающего дата-сайентиста: {len(junior_vacancies)}")
len(junior_vacancies)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\637608347.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

48

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [112]:
# текст запроса
query = '''SELECT COUNT(*)
FROM public.vacancies
WHERE (
    LOWER(name) LIKE '%data scientist%'
    OR LOWER(name) LIKE '%data science%'
    OR LOWER(name) LIKE '%исследователь данных%'
    OR LOWER(name) LIKE '%machine learning%'
    OR LOWER(name) LIKE '%машинн%обучен%'
    OR (LOWER(name) LIKE '% ml%' OR LOWER(name) LIKE 'ml %' OR LOWER(name) LIKE '% ml.' OR LOWER(name) LIKE 'ml.%')
)
AND (
    LOWER(key_skills) LIKE '%sql%'
    OR LOWER(key_skills) LIKE '%postgres%'
);'''

In [113]:
# # результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\3127856963.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    191

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [116]:
# текст запроса
query= '''SELECT COUNT(*)
FROM public.vacancies
WHERE (
    LOWER(name) LIKE '%data scientist%'
    OR LOWER(name) LIKE '%data science%'
    OR LOWER(name) LIKE '%исследователь данных%'
    OR LOWER(name) LIKE '%machine learning%'
    OR LOWER(name) LIKE '%машинн%обучен%'
    OR (LOWER(name) LIKE '% ml%' OR LOWER(name) LIKE 'ml %' OR LOWER(name) LIKE '% ml.' OR LOWER(name) LIKE 'ml.%')
)
AND LOWER(key_skills) LIKE '%python%';
'''

In [117]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    333

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [119]:
# текст запроса
query = """
SELECT *
FROM public.vacancies
WHERE LOWER(name) LIKE '%data scientist%'
    OR LOWER(name) LIKE '%data science%'
    OR LOWER(name) LIKE '%исследователь данных%'
    OR LOWER(name) LIKE '%machine learning%'
    OR LOWER(name) LIKE '%машинн%обучен%'
    OR (LOWER(name) LIKE '% ml%' OR LOWER(name) LIKE 'ml %' OR LOWER(name) LIKE '% ml.' OR LOWER(name) LIKE 'ml.%');
"""

In [123]:
# результат запроса
df = pd.read_sql_query(query, connection)


def count_skills(skills):
    if pd.isna(skills):
        return 0
    return len(skills.split('\t'))
  
df['key_skills_count'] = df['key_skills'].apply(count_skills)
average_key_skills = df['key_skills_count'].mean()
average_key_skills

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\1311192055.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

5.7015945330296125

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [124]:
# текст запроса
# оставим предыдущи й запрос который возвращает нам всех дата сейнтистов 
query = '''SELECT *
FROM public.vacancies v
WHERE LOWER(v.name) LIKE '%data scientist%'
   OR LOWER(v.name) LIKE '%data science%'
   OR LOWER(v.name) LIKE '%исследователь данных%'
   OR LOWER(v.name) LIKE '%machine learning%'
   OR LOWER(v.name) LIKE '%машинн%обучен%'
   OR (LOWER(v.name) LIKE '% ml%' OR LOWER(v.name) LIKE 'ml %' OR LOWER(v.name) LIKE '% ml.' OR LOWER(v.name) LIKE 'ml.%')'''

In [146]:
# результат запроса
df = pd.read_sql_query(query, connection)
# отфильтруем специалистов с опытом работы 3 -6 лет
experiacned_employees_3_6_years = df[df['experience'] == 'От 3 до 6 лет']
#  проверяем что остались только необходимые кандидаты с опытом 3-6
experiacned_employees_3_6_years['experience'].value_counts()
experiacned_employees_3_6_years_with_defined_salary = experiacned_employees_3_6_years[(experiacned_employees_3_6_years['salary_from'].notnull()) | (experiacned_employees_3_6_years['salary_to'].notnull()) ]

# experiacned_employees_3_6_years_with_defined_salary

# Функция для расчета значения нового столбца
def calculate_avg_salary(row):
    salary_from = row['salary_from']
    salary_to = row['salary_to']
    if pd.notnull(salary_from) and pd.notnull(salary_to) :
      return (salary_to + salary_from)/2;
    if  pd.isnull(salary_from):
      return salary_to
    else :
      return salary_from
# сред зп по каждой вакансии 
experiacned_employees_3_6_years_with_defined_salary['avg_salary'] = experiacned_employees_3_6_years_with_defined_salary.apply(calculate_avg_salary,axis=1)
# средняя зп по столбцу
avg_salary = experiacned_employees_3_6_years_with_defined_salary['avg_salary'].mean()
round(avg_salary)

C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2708458885.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)
C:\Users\ilyae\AppData\Local\Temp\ipykernel_26120\2708458885.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  experiacned_employees_3_6_years_with_defined_salary['avg_salary'] = experiacned_employees_3_6_years_with_defined_salary.apply(calculate_avg_salary,axis=1)

243115

***

In [53]:
# выводы по предметному анализу
# сложно сделать выводы так как большинство расчетов платформа определяет как неверный. очень жаль что не был предоставлен промежуточный результат для сверки правиьности выполнения следующего запроса 



# Сколько есть подходящих вакансий для начинающего дата-сайентиста?
# Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
# ‘data scientist’;
# ‘data science’;
# ‘исследователь данных’;
# ‘ML’ (здесь не нужно брать вакансии по HTML);
# ‘machine learning’;
# ‘машинн%обучен%’.

# средняя за по отрасли 243 тысячи для опытных кандидатов.

# Общий вывод по проекту

In [54]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

# честно говоря я немного в смятении по поводу того что не удалось завершить предметный анализ но давайте попробуем проанализировать то что у нас уже есть с первых двух этапов:
# Значит всего у нас 49 196 вакансий
# от 23 501 работодателя из 1 362 регионов страны работоающих в 294 различных сферах
# наибольшее число вакансий закономерно располагается в крупных городах Мск, Спб,Минск, Новосиб Алматы и т.д.
# интересный факт что из почти 50 000 вакансий только у половины заполнено хотя бы одна графа о желаемой зп.
# зарплатные одидания тех кто указал желаему зп колеблются от 71065.0 до 110537.0 (руб)
# самые распостраненные варианты опыта работы от 1 до 3х лет. - более половины сосискателей если сложить их с категорией 2-6 лет работы это 40 000 вакансий из почти 50 000. Нет опыта у 7 000 соискателей.

# самые крупные работодатели охватывающие наибольшее количество территорий это ЯНдекс , Ростелеком, Спецремонт и почему-то г-н Поляков Денис Иванович.